# lesson 4 - поменять местами две переменные, используя знаки + и -

a = int(input('a = '))
b = int(input('b = '))
print('a = ', a)
print('b = ', b)
a = a - b
b = b + a
a = b - a
print('a = ', a)
print('b = ', b)

# lesson 5 - Напишите программу, которая принимает на вход два числа в одну строку и выводит на экран их сумму.

age = int(input())
age += 1
print(age)

# Напишите программу, которая принимает на вход два числа в одну строку и выводит на экран их сумму

