# Задача №1
# Обменник. Создать скрипт который будет запускаться из консоли 1 раз из консоли, выдавать результат и зарываться.
#     1. На вход обменнику вводишь количество денег int.
#     2. На выходе в консоль выводится отввет в таком виде:
#                 "Ты ввёл int (Валюта)"
#                 "конвертированная сумма в USD = int"
#     3. Валюту пользователя определите сами.

your_money = float(input())
convert_money = your_money / 72.88
print('Ты ввёл ', your_money, 'RUB')
print('конвертированная сумма в USD = ', round(convert_money, 2))
